-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: localhost:3306
-- Generation Time: Jun 26, 2024 at 06:23 AM
-- Server version: 10.5.20-MariaDB
-- PHP Version: 7.3.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `id21553181_smartsystem`
--

-- --------------------------------------------------------

--
-- Table structure for table `attendance`
--

CREATE TABLE `attendance` (
  `id` int(255) NOT NULL,
  `student_Token` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `attendance_date` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `present` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `attendance`
--

INSERT INTO `attendance` (`id`, `student_Token`, `attendance_date`, `present`) VALUES
(18, '240613044437115', '2024-06-14', '1'),
(19, '240613044751118', '2024-06-14', '1'),
(20, '240613044907102', '2024-06-14', '1'),
(21, '240613045125157', '2024-06-14', '1'),
(22, '240613045345137', '2024-06-14', '1'),
(23, '240613045616126', '2024-06-14', '1'),
(24, '240613045616126', '2024-06-14', '1'),
(25, '240613045616126', '2024-06-14', '1'),
(26, '240613045616126', '2024-06-14', '1'),
(27, '240613045616126', '2024-06-14', '1'),
(28, '240613045616126', '2024-06-14', '1'),
(29, '240613044953200', '2024-06-14', '1'),
(30, '240613045125157', '2024-06-14', '1'),
(31, '240613045345137', '2024-06-14', '1'),
(32, '240613045722184', '2024-06-14', '1'),
(33, '240613045616126', '2024-06-14', '1'),
(34, '240613045906155', '2024-06-21', '1'),
(35, '240613045722184', '2024-06-21', '1'),
(36, '240623095039132', '2024-06-23', '1'),
(37, '240624060358103', '2024-06-24', '1'),
(38, '240624073353106', '2024-06-24', '1'),
(39, '240624073353106', '2024-06-24', '1'),
(40, '240624060358103', '2024-06-24', '1'),
(41, '240624051517196', '2024-06-24', '1'),
(42, '240624080045163', '2024-06-24', '1'),
(55, '240625041747175', '2024-06-26', '1'),
(56, '240625041747175', '2024-06-26', '1'),
(57, '240625041747175', '2024-06-26', '1'),
(61, '240624051517196', '2024-06-26', '1');

-- --------------------------------------------------------

--
-- Table structure for table `comment`
--

CREATE TABLE `comment` (
  `id` int(255) NOT NULL,
  `comment` varchar(1000) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `token_Student` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Date` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `comment`
--

INSERT INTO `comment` (`id`, `comment`, `token_Student`, `Date`) VALUES
(11, 'متى موعد النتائج', '240613045125157', ''),
(14, 'لماذذا عدد غيباباتي 2 ', '240613045125157', '2024-06-14 18:16:48'),
(20, 'هل توجد محاضرة ليووم غد\r\n', '240613051758155', '2024-06-15 08:11:28'),
(22, 'متى موعد الدور الثاني', '240613051758155', '2024-06-15 08:11:57'),
(35, 'هل الامتحان بكافة المادة', '240623094440191', '2024-06-23 21:46:20');

-- --------------------------------------------------------

--
-- Table structure for table `grading`
--

CREATE TABLE `grading` (
  `id` int(255) NOT NULL,
  `token` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `StudentName` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `grading` varchar(255) NOT NULL,
  `LcName` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `grading`
--

INSERT INTO `grading` (`id`, `token`, `StudentName`, `grading`, `LcName`) VALUES
(185, '240623100338126', 'ِِِAdmin', 'لا توجد درجة', 'مد'),
(186, '240623100338126', 'سجاد حسين علي', 'لا توجد درجة', 'مد'),
(187, '240623100338126', 'نور علي حسين', 'لا توجد درجة', 'مد'),
(188, '240623100338126', 'كاظم سماعيل الكاطع', 'لا توجد درجة', 'مد'),
(189, '240623100338126', 'رضا ستار سعد', 'لا توجد درجة', 'مد'),
(190, '240623100338126', 'حسن عباس حسين', 'لا توجد درجة', 'مد'),
(191, '240623100338126', 'حسن عباس حسين', 'لا توجد درجة', 'مد'),
(192, '240623100338126', 'حسين عباس حسبن', 'لا توجد درجة', 'مد'),
(193, '240623100338126', 'فاضل عبد الساده', 'لا توجد درجة', 'مد'),
(194, '240623100338126', 'محمد علي', 'لا توجد درجة', 'مد'),
(195, '240623100338126', 'علي محسن الحسن', 'لا توجد درجة', 'مد'),
(196, '240623100338126', 'علي قاسم سالم', 'لا توجد درجة', 'مد'),
(197, '240623100338126', 'حسين علي عباس', 'لا توجد درجة', 'مد'),
(198, '240623100338126', 'منتظر قاسم سالم', 'لا توجد درجة', 'مد'),
(199, '240623100338126', 'نرجس باسم قاسم', 'لا توجد درجة', 'مد'),
(200, '240623100338126', 'ali', 'لا توجد درجة', 'مد'),
(201, '240623100338126', 'محمد صادق', 'لا توجد درجة', 'مد'),
(202, '240623100338126', 'حسن عباس حسين', '75', 'مد'),
(203, '240624073447161', 'سجاد علي  علي', 'لا توجد درجة', 'فاينل فصل اول '),
(204, '240624073447161', 'نور علي حسين', 'لا توجد درجة', 'فاينل فصل اول '),
(205, '240624073447161', 'كاظم سماعيل الكاطع', 'لا توجد درجة', 'فاينل فصل اول '),
(206, '240624073447161', 'حسن عباس حسين', 'لا توجد درجة', 'فاينل فصل اول '),
(207, '240624073447161', 'حسين عباس حسبن', 'لا توجد درجة', 'فاينل فصل اول '),
(208, '240624073447161', 'فاضل عبد الساده', 'لا توجد درجة', 'فاينل فصل اول '),
(209, '240624073447161', 'محمد علي', 'لا توجد درجة', 'فاينل فصل اول '),
(210, '240624073447161', 'علي محسن الحسن', 'لا توجد درجة', 'فاينل فصل اول '),
(211, '240624073447161', 'علي قاسم سالم', 'لا توجد درجة', 'فاينل فصل اول '),
(212, '240624073447161', 'حسين علي عباس', 'لا توجد درجة', 'فاينل فصل اول '),
(213, '240624073447161', 'منتظر قاسم سالم', 'لا توجد درجة', 'فاينل فصل اول '),
(214, '240624073447161', 'نرجس باسم قاسم', 'لا توجد درجة', 'فاينل فصل اول '),
(215, '240624073447161', 'محمد صادق', 'لا توجد درجة', 'فاينل فصل اول '),
(216, '240624073447161', 'حسن عباس حسين', 'لا توجد درجة', 'فاينل فصل اول '),
(217, '240624073447161', 'عباس عبدالله', 'لا توجد درجة', 'فاينل فصل اول '),
(218, '240624073447161', 'mohamed', 'لا توجد درجة', 'فاينل فصل اول '),
(219, '240624073447161', 'محمد ', '89', 'فاينل فصل اول '),
(220, '240624074216143', 'سجاد علي  علي', 'لا توجد درجة', 'فاينل فصل اول'),
(221, '240624074216143', 'نور علي حسين', 'لا توجد درجة', 'فاينل فصل اول'),
(222, '240624074216143', 'كاظم سماعيل الكاطع', 'لا توجد درجة', 'فاينل فصل اول'),
(223, '240624074216143', 'حسن عباس حسين', 'لا توجد درجة', 'فاينل فصل اول'),
(224, '240624074216143', 'حسين عباس حسبن', 'لا توجد درجة', 'فاينل فصل اول'),
(225, '240624074216143', 'فاضل عبد الساده', 'لا توجد درجة', 'فاينل فصل اول'),
(226, '240624074216143', 'محمد علي', 'لا توجد درجة', 'فاينل فصل اول'),
(227, '240624074216143', 'علي محسن الحسن', 'لا توجد درجة', 'فاينل فصل اول'),
(228, '240624074216143', 'علي قاسم سالم', 'لا توجد درجة', 'فاينل فصل اول'),
(229, '240624074216143', 'حسين علي عباس', 'لا توجد درجة', 'فاينل فصل اول'),
(230, '240624074216143', 'منتظر قاسم سالم', 'لا توجد درجة', 'فاينل فصل اول'),
(231, '240624074216143', 'نرجس باسم قاسم', 'لا توجد درجة', 'فاينل فصل اول'),
(232, '240624074216143', 'محمد صادق', 'لا توجد درجة', 'فاينل فصل اول'),
(233, '240624074216143', 'حسن عباس حسين', 'لا توجد درجة', 'فاينل فصل اول'),
(234, '240624074216143', 'عباس عبدالله', 'لا توجد درجة', 'فاينل فصل اول'),
(235, '240624074216143', 'mohamed', '50', 'فاينل فصل اول'),
(236, '240624074216143', 'محمد ', 'لا توجد درجة', 'فاينل فصل اول'),
(237, '240624074532119', 'سجاد علي  علي', 'لا توجد درجة', 'كوز فصل رابع'),
(238, '240624074532119', 'نور علي حسين', 'لا توجد درجة', 'كوز فصل رابع'),
(239, '240624074532119', 'كاظم سماعيل الكاطع', 'لا توجد درجة', 'كوز فصل رابع'),
(240, '240624074532119', 'حسن عباس حسين', 'لا توجد درجة', 'كوز فصل رابع'),
(241, '240624074532119', 'حسين عباس حسبن', 'لا توجد درجة', 'كوز فصل رابع'),
(242, '240624074532119', 'فاضل عبد الساده', 'لا توجد درجة', 'كوز فصل رابع'),
(243, '240624074532119', 'محمد علي', 'لا توجد درجة', 'كوز فصل رابع'),
(244, '240624074532119', 'علي محسن الحسن', 'لا توجد درجة', 'كوز فصل رابع'),
(245, '240624074532119', 'علي قاسم سالم', 'لا توجد درجة', 'كوز فصل رابع'),
(246, '240624074532119', 'حسين علي عباس', 'لا توجد درجة', 'كوز فصل رابع'),
(247, '240624074532119', 'منتظر قاسم سالم', 'لا توجد درجة', 'كوز فصل رابع'),
(248, '240624074532119', 'نرجس باسم قاسم', 'لا توجد درجة', 'كوز فصل رابع'),
(249, '240624074532119', 'محمد صادق', 'لا توجد درجة', 'كوز فصل رابع'),
(250, '240624074532119', 'حسن عباس حسين', 'لا توجد درجة', 'كوز فصل رابع'),
(251, '240624074532119', 'عباس عبدالله', 'لا توجد درجة', 'كوز فصل رابع'),
(252, '240624074532119', 'mohamed', '89', 'كوز فصل رابع'),
(253, '240624074532119', 'محمد ', 'لا توجد درجة', 'كوز فصل رابع'),
(254, '240624090108170', 'محمود', 'لا توجد درجة', 'mid'),
(255, '240624090108170', 'نور', '29', 'mid'),
(256, '240624090108170', 'محمود2', 'لا توجد درجة', 'mid'),
(257, '240624090335115', 'محمود', '29', 'mid'),
(258, '240624090335115', 'نور', 'لا توجد درجة', 'mid'),
(259, '240624090335115', 'محمود2', '29', 'mid'),
(260, '240624090458104', 'محمود', '98', 'فاينل فصل اول'),
(261, '240624090458104', 'نور', 'لا توجد درجة', 'فاينل فصل اول'),
(262, '240624090458104', 'محمود2', 'لا توجد درجة', 'فاينل فصل اول');

-- --------------------------------------------------------

--
-- Table structure for table `homework`
--

CREATE TABLE `homework` (
  `id` int(255) NOT NULL,
  `Detils` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `file` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `report`
--

CREATE TABLE `report` (
  `id` int(255) NOT NULL,
  `public_report` varchar(1000) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `schedules`
--

CREATE TABLE `schedules` (
  `id` int(255) NOT NULL,
  `group_name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `day1` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `time1` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `day2` varchar(255) CHARACTER SET utf32 COLLATE utf32_persian_ci NOT NULL,
  `time2` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `day3` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `time3` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Dumping data for table `schedules`
--

INSERT INTO `schedules` (`id`, `group_name`, `day1`, `time1`, `day2`, `time2`, `day3`, `time3`) VALUES
(5, 'بنات ال600', 'السبت', '2-12', 'الإثنين', '12-10', 'الخميس', '2-12'),
(6, 'ولد ال600', 'السبت', '6-4 ', 'الإثنين', '6-4', 'الخميس', '6-4'),
(7, 'الصف الذهبي', 'السبت', '12-10', 'الإثنين', '2-12', 'الخميس', '12-10'),
(8, 'صف المتميزين', 'السبت', '4-2', 'الإثنين', '4-2', 'الخميس', '8-6'),
(9, 'بنات الاعظمية', 'الأحد', '3-2', 'الثلاثاء', '6-4', 'الأربعاء', '6-4');

-- --------------------------------------------------------

--
-- Table structure for table `schoolwork`
--

CREATE TABLE `schoolwork` (
  `id` int(255) NOT NULL,
  `file` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `studenttoken` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `schoolwork`
--

INSERT INTO `schoolwork` (`id`, `file`, `studenttoken`) VALUES
(12, 'ExamFile/حسن جواد 6.pdf', '240613045906155'),
(13, 'ExamFile/multimedia (3).pdf', '240613045906155'),
(14, 'ExamFile/photo_2024-06-23_19-58-31.pdf', '240623094440191');

-- --------------------------------------------------------

--
-- Table structure for table `students`
--

CREATE TABLE `students` (
  `id` int(255) NOT NULL,
  `token` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `code` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `password` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `gender` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `Rank` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `students`
--

INSERT INTO `students` (`id`, `token`, `name`, `code`, `password`, `gender`, `Rank`) VALUES
(1, '100200300400500600', 'ِِِAdmin', '1000700090003000', 'admin10000@', 'ذكر', '10'),
(28, '240624051517196', 'درر قصي كاطع', '32220240624201501', 'sony', 'أنثى', '0'),
(29, '240624071125116', 'أبرار حيدر حسن', '47720240624220532', 'alnajmgold10', 'أنثى', '0'),
(30, '240624071221181', 'اسل احمد مجيد ', '44820240624221207', 'alnajmgold10', 'أنثى', '0'),
(31, '240624071307144', 'امل ناطق محمود', '48520240624221307', 'alnajmgold10', 'أنثى', '0'),
(32, '240624071507172', 'دانيه احمد فائز', '33120240624221454', 'alnajmgold10', 'أنثى', '0'),
(33, '240624071541116', 'دانيه ياسر حميد', '17520240624221531', 'alnajmgold10', 'أنثى', '0'),
(34, '240624071653187', 'انية مصطفى كريم', '49120240624221639', 'alnajmgold10', 'أنثى', '0'),
(35, '240624071740197', 'رؤى محمد كاظم', '32920240624221729', 'alnajmgold10', 'أنثى', '0'),
(36, '240624071815166', 'رحمة فاضل محمد', '23520240624221804', 'alnajmgold10', 'أنثى', '0'),
(37, '240624071845171', 'رسل عباس مال الله', '47020240624221833', 'alnajmgold10', 'أنثى', '0'),
(38, '240624071917158', 'رويدة صلاح نواف', '20020240624221905', 'alnajmgold10', 'أنثى', '0'),
(39, '240624071956189', 'زكاء محمد عبد الكريم ', '24020240624221946', 'alnajmgold10', 'أنثى', '0'),
(40, '240624072136177', 'زهراء أيوب كاطع', '39020240624222116', 'alnajmgold10', 'أنثى', '0'),
(41, '240624072246188', ' زهراء رسول خزعل', '34320240624222228', 'alnajmgold10', 'أنثى', '0'),
(42, '240624072321106', 'زينب حسن جبار', '41820240624222313', 'alnajmgold10', 'أنثى', '0'),
(44, '240624072408125', 'زينب عادل متعب', '25820240624222358', 'alnajmgold10', 'أنثى', '0'),
(45, '240624072445183', 'زينب عدنان كاظم', '27720240624222433', 'alnajmgold10', 'أنثى', '0'),
(46, '240624072516155', 'زينب نصير عباس', '39720240624222504', 'alnajmgold10', 'أنثى', '0'),
(47, '240624072744176', 'سارة شهاب احمد', '42520240624222717', 'alnajmgold10', 'أنثى', '0'),
(48, '240624072833168', 'سارة صفاء مجيد', '27420240624222828', 'alnajmgold10', 'أنثى', '0'),
(49, '240624072854121', 'سما سرمد غالي', '27020240624222845', 'alnajmgold10', 'أنثى', '0'),
(50, '240624073051189', 'سولاف رأفت إسماعيل', '14720240624223045', 'alnajmgold10', 'أنثى', '0'),
(51, '240624073403181', 'زهراء حسن عبد الهادي', '34120240624223357', 'alnajmgold10', 'أنثى', '0'),
(52, '240624073427179', 'شمس سامر سعدون', '43820240624223422', 'alnajmgold10', 'أنثى', '0'),
(53, '240624073445118', 'صفا محمد حسن', '26920240624223440', 'alnajmgold10', 'أنثى', '0'),
(54, '240624073503166', 'ضحى حبيب عباس', '42220240624223458', 'alnajmgold10', 'أنثى', '0'),
(55, '240624073523149', 'ضي وليد خالد', '49420240624223516', 'alnajmgold10', 'أنثى', '0'),
(56, '240624073550175', 'طيبة نزار عبد الستار', '11520240624223539', 'alnajmgold10', 'أنثى', '0'),
(57, '240624073615103', 'طيبة عماد عمران', '29520240624223608', 'alnajmgold10', 'أنثى', '0'),
(58, '240624073636158', 'غدير طارق علي', '49720240624223630', 'alnajmgold10', 'أنثى', '0'),
(59, '240624073656155', 'فاطمة علي اسماعيل', '39120240624223650', 'alnajmgold10', 'أنثى', '0'),
(60, '240624073715179', 'فاطمة طالب عبدالله', '47620240624223709', 'alnajmgold10', 'أنثى', '0'),
(61, '240624073735193', 'قمر سنان قاسم', '12820240624223728', 'alnajmgold10', 'أنثى', '0'),
(62, '240624073759159', 'كوثر مجتبى جمال', '45320240624223751', 'alnajmgold10', 'أنثى', '0'),
(63, '240624073816151', 'لنا علي باقر', '22220240624223810', 'alnajmgold10', 'أنثى', '0'),
(64, '240624073843171', 'مريام بسام حاتم', '37120240624223836', 'alnajmgold10', 'أنثى', '0'),
(65, '240624073911100', 'مريم مولود شهاب', '45120240624223907', 'alnajmgold10', 'أنثى', '0'),
(66, '240624074118164', 'ملاك علي احمد', '34920240624224113', 'alnajmgold10', 'أنثى', '0'),
(67, '240624074138121', 'ملاك مصطفى سلمان', '18120240624224133', 'alnajmgold10', 'أنثى', '0'),
(68, '240624074201150', 'نور الزهراء اسامة تحسين', '32320240624224158', 'alnajmgold10', 'أنثى', '0'),
(69, '240624074217193', 'نور جمال مجيد', '35620240624224214', 'alnajmgold10', 'أنثى', '0'),
(70, '240624074243151', 'نور الشمس مصطفى غسان', '17420240624224239', 'alnajmgold10', 'أنثى', '0'),
(71, '240624074304189', 'هبة احمد كامل', '36920240624224301', 'alnajmgold10', 'أنثى', '0'),
(72, '240624074323142', 'وسن مولود شهاب', '24220240624224320', 'alnajmgold10', 'أنثى', '0'),
(73, '240624074345178', 'يسر صفاء حسين', '19220240624224342', 'alnajmgold10', 'أنثى', '0'),
(74, '240624075332103', 'آن لؤي طه', '14520240624225328', 'alnajm10m', 'أنثى', '0'),
(75, '240624075400129', 'اساور عباس فاضل', '27820240624225354', 'alnajm10m', 'أنثى', '0'),
(76, '240624075416116', 'امنه عامر محمد', '10720240624225412', 'alnajm10m', 'أنثى', '0'),
(77, '240624075432164', 'امنه مروان نعمان', '26320240624225428', 'alnajm10m', 'أنثى', '0'),
(78, '240624075449165', 'بسملة أحمد ثامر', '19320240624225446', 'alnajm10m', 'أنثى', '0'),
(79, '240624075507120', 'تقى جمال محمد', '39120240624225503', 'alnajm10m', 'أنثى', '0'),
(80, '240624075556159', 'تقى علي عبد محمد', '21720240624225549', 'alnajm10m', 'أنثى', '0'),
(81, '240624075623160', 'دانية زياد سالم', '20120240624225619', 'alnajm10m', 'أنثى', '0'),
(82, '240624075649196', 'رقية محمد حسين', '11720240624225645', 'alnajm10m', 'أنثى', '0'),
(83, '240624075707149', 'رند فؤاد محمد', '44920240624225703', 'alnajm10m', 'أنثى', '0'),
(84, '240624075721172', 'روز زياد سعدي', '33620240624225718', 'alnajm10m', 'أنثى', '0'),
(85, '240624075740115', 'سارة طه عبد الخالق', '10620240624225737', 'alnajm10m', 'أنثى', '0'),
(86, '240624075756167', 'سارة عباس فاضل', '10720240624225752', 'alnajm10m', 'أنثى', '0'),
(87, '240624075817104', 'ضوية احمد نعمان', '43220240624225814', 'alnajm10m', 'أنثى', '0'),
(88, '240624075834102', 'فاطمة وليد حسن', '21120240624225831', 'alnajm10m', 'أنثى', '0'),
(89, '240624075851176', 'كوثر بكر قاسم', '49120240624225848', 'alnajm10m', 'أنثى', '0'),
(90, '240624075907143', 'مريم احمد قاسم', '15520240624225903', 'alnajm10m', 'أنثى', '0'),
(91, '240624075926108', 'ملاذ مثنى جاسم', '44920240624225922', 'alnajm10m', 'أنثى', '0'),
(92, '240624075944174', 'منى مطر عبود', '33020240624225940', 'alnajm10m', 'أنثى', '0'),
(93, '240624075959187', 'مينا حميد مجيد', '31220240624225956', 'alnajm10m', 'أنثى', '0'),
(94, '240624080015130', 'نبأ نبيل عباس', '41020240624230011', 'alnajm10m', 'أنثى', '0'),
(95, '240624080030152', 'نور عباس فاضل', '24020240624230027', 'alnajm10m', 'أنثى', '0'),
(96, '240624080045163', 'ورود محمود علي', '2009', 'alnajm10m', 'أنثى', '0'),
(97, '240624080117174', 'يقين حامد اسماعيل', '30020240624230113', 'alnajm10m', 'أنثى', '0'),
(98, '240624080428166', 'لشراء هيثم خزعل', '25120240624230424', 'alnajm600', 'أنثى', '0'),
(99, '240624080452156', 'تقوى القلوب رفعت محمود', '48720240624230448', 'alnajm600', 'أنثى', '0'),
(100, '240624080512145', 'جودي ايمن دهام', '25320240624230508', 'alnajm600', 'أنثى', '0'),
(101, '240624080526192', 'دانية مسعود', '36920240624230522', 'alnajm600', '', '0'),
(102, '240624080546189', 'رحمة عبد القادر عبد الكريم', '35520240624230543', 'alnajm600', 'أنثى', '0'),
(103, '240624080615108', 'رقية صلاح حسن', '46520240624230611', 'alnajm600', 'أنثى', '0'),
(104, '240624080629177', 'رنيم قاسم محمد', '28820240624230626', 'alnajm600', 'أنثى', '0'),
(105, '240624080645158', 'رهف احسان خالد', '30420240624230641', 'alnajm600', 'أنثى', '0'),
(106, '240624080659130', 'روان مهند محمود', '38320240624230655', 'alnajm600', 'أنثى', '0'),
(107, '240624080726118', 'روان هاشم طلعت', '13820240624230720', 'alnajm600', 'أنثى', '0'),
(108, '240624080744192', 'ريا محمد عذاب ', '22120240624230740', 'alnajm600', 'أنثى', '0'),
(109, '240624080803165', 'زهراء حسن عبد الهادي', '26620240624230800', 'alnajm600', 'أنثى', '0'),
(110, '240624080819130', 'زينب علي كاظم ', '25820240624230816', 'alnajm600', 'أنثى', '0'),
(111, '240624080835131', 'زينة اياد باسم', '47320240624230832', 'alnajm600', 'أنثى', '0'),
(112, '240624080855151', 'زينة اياد باسم محمد', '31820240624230852', 'alnajm600', 'أنثى', '0'),
(113, '240624080908155', 'سارة عادي عامر', '22620240624230905', 'alnajm600', 'أنثى', '0'),
(114, '240624081131166', 'رضا احمد منشد', '42120240624231128', 'alnajm600', 'أنثى', '0'),
(115, '240624081147160', 'ابراهيم عمر حيدر', '42920240624231143', 'alnajm600', 'ذكر', '0'),
(116, '240624081339165', 'عبدالله ستار عبد', '43920240624231336', 'alnajm600', 'ذكر', '0'),
(117, '240624081355133', 'يزن رائد صبحي', '28520240624231352', 'alnajm600', 'ذكر', '0'),
(118, '240624081410108', 'ايمن احمد شهاب', '48520240624231407', 'alnajm600', 'ذكر', '0'),
(119, '240624081435154', 'مرتضى احمد منشد', '15720240624231429', 'alnajm600', 'ذكر', '0'),
(121, '240624081504138', 'عبدالله محمد حافظ', '39620240624231458', 'alnajm600', 'ذكر', '0'),
(122, '240624081518174', 'طالب مشتاق طالب', '45320240624231514', 'alnajm600', 'ذكر', '0'),
(123, '240624081533132', 'احمد عباس فاضل', '10820240624231530', 'alnajm600', 'ذكر', '0'),
(124, '240624081546138', 'علي عدنان كاظم', '40620240624231543', 'alnajm600', 'ذكر', '0'),
(126, '240624081618150', 'حسن غسان نجم', '31620240624231613', 'alnajm600', 'ذكر', '0'),
(127, '240624081643165', 'الحسن علي حسن', '37820240624231640', 'alnajm600', 'ذكر', '0'),
(128, '240624081656159', 'خلدون محمد خالد', '46320240624231652', 'alnajm600', 'ذكر', '0'),
(129, '240624081719142', 'عبد الرحمن الحارث مثنى', '44420240624231716', 'alnajm600', 'ذكر', '0'),
(130, '240624081731189', 'رضا يوسف محمد', '31520240624231729', 'alnajm600', 'ذكر', '0'),
(131, '240624081745194', 'سامر يحيى سامر', '39620240624231742', 'alnajm600', 'ذكر', '0'),
(132, '240624081801196', 'علي محمد قاسم', '20920240624231758', 'alnajm600', 'ذكر', '0'),
(133, '240624081823105', 'عبد الرحمن شامل مجيد', '48620240624231820', 'alnajm600', 'ذكر', '0'),
(134, '240624081839187', 'احمد عباس فاضل ', '39920240624231836', 'alnajm600', 'ذكر', '0'),
(135, '240624081901104', 'زيد منذر حسين', '39820240624231858', 'alnajm600', 'ذكر', '0'),
(136, '240624081924127', 'محمد عدي مشعان', '24720240624231921', 'alnajm600', 'ذكر', '0'),
(140, '240624082656131', 'سيف الدين زياد', '30820240624232653', 'alnajm##17', 'ذكر', '0'),
(141, '240624082715128', 'سيف الدين زياد طارق', '15820240624232712', 'alnajm##17', 'ذكر', '0'),
(142, '240624082735172', 'سيف ذو الفقار عادل', '23420240624232731', 'alnajm##17', 'ذكر', '0'),
(143, '240624082819171', 'عبدالله رفعت محمود', '22520240624232816', 'alnajm##17', 'ذكر', '0'),
(144, '240624082833162', 'عبدالله عمر احمد ', '30920240624232829', 'alnajm##17', 'ذكر', '0'),
(145, '240624082904135', 'علي باسم علي', '42220240624232900', 'alnajm##17', 'ذكر', '0'),
(146, '240624082919131', 'غيث احمد وداد', '12320240624232916', 'alnajm##17', 'ذكر', '0'),
(147, '240624082940147', 'فهد بهاء زهير', '43020240624232937', 'alnajm##17', 'ذكر', '0'),
(148, '240624083046190', 'محمد احمد محمد', '33320240624233043', 'alnajm##17', 'ذكر', '0'),
(149, '240624083109124', 'محمد باقر حسين علي', '40520240624233106', 'alnajm##17', 'ذكر', '0'),
(150, '240624083123106', 'محمد حيدر عباس', '15920240624233120', 'alnajm##17', 'ذكر', '0'),
(151, '240624083215103', 'محمد رفعت محمود', '39620240624233212', 'alnajm##17', 'ذكر', '0'),
(152, '240624083230158', 'ميثم احمد كاظم', '44020240624233227', 'alnajm##17', 'ذكر', '0'),
(153, '240624083243180', 'ياسر عزت عباس', '44920240624233240', 'alnajm##17', 'ذكر', '0'),
(154, '240624083259191', 'يوسف اياد فاضل', '24920240624233256', 'alnajm##17', 'ذكر', '0'),
(155, '240624083901193', 'محمد اسعد محمود', '10420240624233858', 'alnajm##17', 'ذكر', '0'),
(156, '240624084048194', 'الحسن واثق لفتة', '43620240624234039', 'alnajm##17', 'ذكر', '0'),
(157, '240625013802151', 'نور النجم ', '28120240625163748', 'alnajm5', 'أنثى', '0'),
(159, '240625041747175', 'محمود النجم ', '28920240625191739', 'alnajm5', 'ذكر', '0');

-- --------------------------------------------------------

--
-- Table structure for table `week_schedule`
--

CREATE TABLE `week_schedule` (
  `id` int(255) NOT NULL,
  `day` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `time` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `note` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `week_schedule`
--

INSERT INTO `week_schedule` (`id`, `day`, `time`, `note`) VALUES
(1, 'السبت', '10:00', '(الصف الذهبي:10-12) (بنات ال600: 12-2 )( ولد ال600: 4-6)'),
(2, 'الأحد', '16:01', 'بنات ال 600'),
(3, 'الاثنين', '14:00', 'يوجد'),
(4, 'الثلاثاء', '19:36', 'يوجد'),
(5, 'الأربعاء', '22:42', 'يوجد'),
(6, 'الخميس', '20:59', 'لايوجد'),
(7, 'الجمعة', '20:10', 'يوجد');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `attendance`
--
ALTER TABLE `attendance`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `grading`
--
ALTER TABLE `grading`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `homework`
--
ALTER TABLE `homework`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `report`
--
ALTER TABLE `report`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `schedules`
--
ALTER TABLE `schedules`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `schoolwork`
--
ALTER TABLE `schoolwork`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `students`
--
ALTER TABLE `students`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `week_schedule`
--
ALTER TABLE `week_schedule`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `attendance`
--
ALTER TABLE `attendance`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=62;

--
-- AUTO_INCREMENT for table `comment`
--
ALTER TABLE `comment`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=46;

--
-- AUTO_INCREMENT for table `grading`
--
ALTER TABLE `grading`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=263;

--
-- AUTO_INCREMENT for table `homework`
--
ALTER TABLE `homework`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=40;

--
-- AUTO_INCREMENT for table `report`
--
ALTER TABLE `report`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9;

--
-- AUTO_INCREMENT for table `schedules`
--
ALTER TABLE `schedules`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `schoolwork`
--
ALTER TABLE `schoolwork`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT for table `students`
--
ALTER TABLE `students`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=160;

--
-- AUTO_INCREMENT for table `week_schedule`
--
ALTER TABLE `week_schedule`
  MODIFY `id` int(255) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=15;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
